La-guajolota/PSOC-5lp/lcd_7seg/7seg_multiplexado_firmware.cydsn/codegentemp/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.4
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "Segmentos_7seg.h"
#include "seg_0_aliases.h"
#include "seg_0.h"
#include "seg_1_aliases.h"
#include "seg_1.h"
#include "seg_2_aliases.h"
#include "seg_2.h"
#include "seg_3_aliases.h"
#include "seg_3.h"
#include "seg_4_aliases.h"
#include "seg_4.h"
#include "seg_5_aliases.h"
#include "seg_5.h"
#include "seg_6_aliases.h"
#include "seg_6.h"
#include "Clock_1.h"
#include "Botons_aliases.h"
#include "Status_Botones.h"
#include "ISR_botones.h"
#include "Display_0_aliases.h"
#include "Display_0.h"
#include "Displays_mux.h"
#include "Display_1_aliases.h"
#include "Display_1.h"
#include "Display_2_aliases.h"
#include "Display_2.h"
#include "Display_3_aliases.h"
#include "Display_3.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "cy_em_eeprom.h"

/*[]*/

